---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarInSystem.NumberOfBarPositions
source: html/2c21e5cd-9d10-c9a7-3d5f-68327a04b7b9.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.NumberOfBarPositions Property

The number of bar positions available in the rebar.

## Syntax (C#)
```csharp
public int NumberOfBarPositions { get; }
```